stm32duino/Arduino_Core_STM32/cores/arduino/stm32/analog.c
      #if defined(STM32L0xx) || defined(STM32L4xx)
      context[indice].DmaHandle.Init.Request             = DMA_REQUEST_0;
      #endif

      #if defined(STM32F2xx) || defined(STM32F4xx) || defined(STM32F7xx)
      #ifdef ADC1_BASE
      if (hadc->Instance == ADC1)
      {
        context[indice].DmaHandle.Init.Channel           = DMA_CHANNEL_0;
      }
      #endif
      #ifdef ADC2_BASE
      if (hadc->Instance == ADC2)
      {
        context[indice].DmaHandle.Init.Channel           = DMA_CHANNEL_1;
      }
      #endif
      #ifdef ADC3_BASE
      if (hadc->Instance == ADC3)
      {
        context[indice].DmaHandle.Init.Channel           = DMA_CHANNEL_2;
      }
      #endif
      #endif //STM32F2xx STM32F4xx STM32F7xx

      context[indice].DmaHandle.Instance                 = channel;
      context[indice].DmaHandle.Init.Direction           = DMA_PERIPH_TO_MEMORY;
      context[indice].DmaHandle.Init.PeriphInc           = DMA_PINC_DISABLE;
      context[indice].DmaHandle.Init.MemInc              = DMA_MINC_ENABLE;
      context[indice].DmaHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      context[indice].DmaHandle.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
      context[indice].DmaHandle.Init.Mode                = DMA_NORMAL;
      context[indice].DmaHandle.Init.Priority            = DMA_PRIORITY_MEDIUM;

      #if defined(STM32F2xx) || defined(STM32F4xx) || defined(STM32F7xx)
      context[indice].DmaHandle.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
      context[indice].DmaHandle.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_HALFFULL;
      context[indice].DmaHandle.Init.MemBurst            = DMA_MBURST_SINGLE;
      context[indice].DmaHandle.Init.PeriphBurst         = DMA_PBURST_SINGLE;
      #endif //STM32F2xx STM32F4xx STM32F7xx
          
      /* Deinitialize  & Initialize the DMA for new transfer */
      HAL_DMA_DeInit(&context[indice].DmaHandle);
      HAL_DMA_Init(&context[indice].DmaHandle);

      /* Associate the DMA handle */
      __HAL_LINKDMA(hadc, DMA_Handle, context[indice].DmaHandle);

      /* NVIC */
      HAL_NVIC_SetPriority(irqHandler, 1, 0);
      HAL_NVIC_EnableIRQ(irqHandler);
    }
  }
}

/**
  * @brief  DeInitializes the ADC MSP.
  * @param  hadc: ADC handle
  * @retval None
  */
void HAL_ADC_MspDeInit(ADC_HandleTypeDef* hadc)
{
  uint8_t indice = 255;

#ifdef __HAL_RCC_ADC_FORCE_RESET
  __HAL_RCC_ADC_FORCE_RESET();
#endif
#ifdef __HAL_RCC_ADC_RELEASE_RESET
  __HAL_RCC_ADC_RELEASE_RESET();
#endif

  if(hadc->Instance == ADC1) {
#ifdef __HAL_RCC_ADC1_FORCE_RESET
	__HAL_RCC_ADC1_FORCE_RESET();
#endif
#ifdef __HAL_RCC_ADC1_RELEASE_RESET
    __HAL_RCC_ADC1_RELEASE_RESET();
#endif
#ifdef __HAL_RCC_ADC12_FORCE_RESET
	__HAL_RCC_ADC12_FORCE_RESET();
#endif
#ifdef __HAL_RCC_ADC12_RELEASE_RESET
    __HAL_RCC_ADC12_RELEASE_RESET();
#endif
#ifdef __HAL_RCC_ADC1_CLK_DISABLE
	__HAL_RCC_ADC1_CLK_DISABLE();
#endif
#ifdef __HAL_RCC_ADC12_CLK_DISABLE
	__HAL_RCC_ADC12_CLK_DISABLE();
#endif
  }
#ifdef ADC2
  else if(hadc->Instance == ADC2) {
#ifdef __HAL_RCC_ADC2_FORCE_RESET
	__HAL_RCC_ADC2_FORCE_RESET();
#endif
#ifdef __HAL_RCC_ADC2_RELEASE_RESET
    __HAL_RCC_ADC2_RELEASE_RESET();
#endif
#ifdef __HAL_RCC_ADC12_FORCE_RESET
	__HAL_RCC_ADC12_FORCE_RESET();
#endif
#ifdef __HAL_RCC_ADC12_RELEASE_RESET
    __HAL_RCC_ADC12_RELEASE_RESET();
#endif
#ifdef __HAL_RCC_ADC2_CLK_DISABLE
	__HAL_RCC_ADC2_CLK_DISABLE();
#endif
#ifdef __HAL_RCC_ADC2_CLK_DISABLE
	__HAL_RCC_ADC2_CLK_DISABLE();
#endif
  }
#endif
#ifdef ADC3
  else if(hadc->Instance == ADC3) {
#ifdef __HAL_RCC_ADC3_FORCE_RESET
	__HAL_RCC_ADC3_FORCE_RESET();
#endif
#ifdef __HAL_RCC_ADC3_RELEASE_RESET
    __HAL_RCC_ADC3_RELEASE_RESET();
#endif
#ifdef __HAL_RCC_ADC34_FORCE_RESET
	__HAL_RCC_ADC34_FORCE_RESET();
#endif
#ifdef __HAL_RCC_ADC34_RELEASE_RESET
    __HAL_RCC_ADC34_RELEASE_RESET();
#endif
#ifdef __HAL_RCC_ADC3_CLK_DISABLE
    __HAL_RCC_ADC3_CLK_DISABLE();
#endif
#ifdef __HAL_RCC_ADC34_CLK_DISABLE
    __HAL_RCC_ADC34_CLK_DISABLE();
#endif
  }
#endif
#ifdef ADC4
  else if(hadc->Instance == ADC4) {
	__HAL_RCC_ADC34_FORCE_RESET();
    __HAL_RCC_ADC34_RELEASE_RESET();
    __HAL_RCC_ADC34_CLK_DISABLE();
  }
#endif
#ifdef __HAL_RCC_ADC_CLK_DISABLE
  __HAL_RCC_ADC_CLK_DISABLE();
#endif

  indice = get_indice(hadc->Instance);

  if (context[indice].use_dma)
  {
    dma_free(hadc->Instance);
    HAL_DMA_DeInit(hadc->DMA_Handle);
  }
}

/**
  * @brief  This function will set the ADC to the required value
  * @param  pin : the pin to use
  * @retval the value of the adc
  */
uint16_t adc_read_value(PinName pin)
{
  ADC_ChannelConfTypeDef  AdcChannelConf = {};
  __IO uint16_t uhADCxConvertedValue = 0;
  void *peripheral;
  uint8_t indice = 255;

  peripheral                         = pinmap_peripheral(pin, PinMap_ADC);
  indice                             = get_indice(peripheral);
  context[indice].current_pin        = pin;                                           /* Needed for HAL_ADC_MspInit */
  context[indice].AdcHandle.Instance = peripheral;


  if (context[indice].AdcHandle.Instance == NP) return 0;

#ifndef STM32F1xx
  context[indice].AdcHandle.Init.ClockPrescaler        = ADC_CLOCK_DIV;                /* Asynchronous clock mode, input ADC clock divided */
  context[indice].AdcHandle.Init.Resolution            = ADC_RESOLUTION_12B;            /* 12-bit resolution for converted data */
  context[indice].AdcHandle.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;           /* EOC flag picked-up to indicate conversion end */
  context[indice].AdcHandle.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE; /* Parameter discarded because software trigger chosen */
  context[indice].AdcHandle.Init.DMAContinuousRequests = DISABLE;                       /* DMA one-shot mode selected (not applied to this example) */
#endif
  context[indice].AdcHandle.Init.DataAlign             = ADC_DATAALIGN_RIGHT;           /* Right-alignment for converted data */
  context[indice].AdcHandle.Init.ScanConvMode          = DISABLE;                       /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
  context[indice].AdcHandle.Init.ContinuousConvMode    = DISABLE;                       /* Continuous mode disabled to have only 1 conversion at each conversion trig */
  context[indice].AdcHandle.Init.DiscontinuousConvMode = DISABLE;                       /* Parameter discarded because sequencer is disabled */
  context[indice].AdcHandle.Init.ExternalTrigConv      = ADC_SOFTWARE_START;            /* Software start to trig the 1st conversion manually, without external event */
  context[indice].AdcHandle.State = HAL_ADC_STATE_RESET;
#if defined (STM32F0xx) || defined (STM32L0xx)
  context[indice].AdcHandle.Init.LowPowerAutoWait      = DISABLE;                       /* Auto-delayed conversion feature disabled */
  context[indice].AdcHandle.Init.LowPowerAutoPowerOff  = DISABLE;                       /* ADC automatically powers-off after a conversion and automatically wakes-up when a new conversion is triggered */
  context[indice].AdcHandle.Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;      /* DR register is overwritten with the last conversion result in case of overrun */
#ifdef STM32F0xx
  context[indice].AdcHandle.Init.SamplingTimeCommon    = SAMPLINGTIME;
#else // STM32L0
  //LowPowerFrequencyMode to enable if clk freq < 2.8Mhz
  context[indice].AdcHandle.Init.SamplingTime          = SAMPLINGTIME;
#endif
#else
#ifdef STM32F3xx
  context[indice].AdcHandle.Init.LowPowerAutoWait      = DISABLE;                       /* Auto-delayed conversion feature disabled */
#endif
  context[indice].AdcHandle.Init.NbrOfConversion       = 1;                             /* Specifies the number of ranks that will be converted within the regular group sequencer. */
  context[indice].AdcHandle.Init.NbrOfDiscConversion   = 0;                             /* Parameter discarded because sequencer is disabled */
#endif

  context[indice].use_dma = false;

  if (HAL_ADC_Init(&context[indice].AdcHandle) != HAL_OK) {
    return 0;
  }

  AdcChannelConf.Channel      = get_adc_channel(pin);             /* Specifies the channel to configure into ADC */
#ifdef STM32L4xx
  if (!IS_ADC_CHANNEL(&context[indice].AdcHandle, AdcChannelConf.Channel)) return 0;
#else
  if (!IS_ADC_CHANNEL(AdcChannelConf.Channel)) return 0;
#endif
  AdcChannelConf.Rank         = ADC_REGULAR_RANK_1;               /* Specifies the rank in the regular group sequencer */
#ifndef STM32L0xx
  AdcChannelConf.SamplingTime = SAMPLINGTIME;                     /* Sampling time value to be set for the selected channel */
#endif
  /*##-2- Configure ADC regular channel ######################################*/
  if (HAL_ADC_ConfigChannel(&context[indice].AdcHandle, &AdcChannelConf) != HAL_OK)
  {
    /* Channel Configuration Error */
    return 0;
  }

#if defined (STM32F0xx) || defined (STM32F1xx) || defined (STM32F3xx) || defined (STM32L0xx) || defined (STM32L4xx)
  /*##-2.1- Calibrate ADC then Start the conversion process ####################*/
#if defined (STM32F0xx) || defined (STM32F1xx)
  if (HAL_ADCEx_Calibration_Start(&context[indice].AdcHandle) !=  HAL_OK)
#else
  if (HAL_ADCEx_Calibration_Start(&context[indice].AdcHandle, ADC_SINGLE_ENDED) !=  HAL_OK)
#endif
  {
    /* ADC Calibration Error */
    return 0;
  }
#endif

  /*##-3- Start the conversion process ####################*/
  if (HAL_ADC_Start(&context[indice].AdcHandle) != HAL_OK)
  {
    /* Start Conversation Error */
    return 0;
  }

  /*##-4- Wait for the end of conversion #####################################*/
  /*  For simplicity reasons, this example is just waiting till the end of the
      conversion, but application may perform other tasks while conversion
      operation is ongoing. */
  if (HAL_ADC_PollForConversion(&context[indice].AdcHandle, 10) != HAL_OK)
  {
    /* End Of Conversion flag not set on time */
    return 0;
  }

  /* Check if the continous conversion of regular channel is finished */
  if ((HAL_ADC_GetState(&context[indice].AdcHandle) & HAL_ADC_STATE_REG_EOC) == HAL_ADC_STATE_REG_EOC)
  {
    /*##-5- Get the converted value of regular channel  ########################*/
    uhADCxConvertedValue = HAL_ADC_GetValue(&context[indice].AdcHandle);
  }

  if (HAL_ADC_Stop(&context[indice].AdcHandle) != HAL_OK)
  {
    /* Stop Conversation Error */
    return 0;
  }

  if(HAL_ADC_DeInit(&context[indice].AdcHandle) != HAL_OK) {
    return 0;
  }

